Autodesk.Navisworks.Api.Rule
An instance of a rule that is used by plugins to apply behaviour.

Autodesk.Navisworks.Api.Rule.AllParamsAreSet
Determines if all of the required parameters for the rule have been set.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Rule.CreateCopy
Creates a copy of the rule.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Rule.DisplayName
Name of the rule as diplayed in the GUI.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.Rule.IsEnabled
Determines if this rule is enabled.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.Rule.IsImplemented
Determines if the plugin that implements this rule has been found.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Rule.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.Rule.SomeParamsAreSet
Determines if any of the required parameters for the rule have been set.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Rule.ValueEquals(Autodesk.Navisworks.Api.Rule)
Performs comparison 'By Value'

Autodesk.Navisworks.Api.Rule.ValueEquals(Autodesk.Navisworks.Api.Rule,Autodesk.Navisworks.Api.Rule)
Compares the two references 'By Value'